#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <string.h>
#include <math.h>
#include<stdlib.h>
////输出什么？
//int main() {
//	char a = -1;
//	//原码：10000000000000000000000000000001
//	//反码：11111111111111111111111111111110
//	//补码：11111111111111111111111111111111
//	//11111111(char只存一个字节，后八位)
//	//发生整型提升：11111111111111111111111111111111=-1
//
//	signed char b = -1;
//	//11111111(char只存一个字节，后八位)
//	//发生整型提升：11111111111111111111111111111111=-1
//	unsigned char c = -1;
//	//11111111(char只存一个字节，后八位)
//	//发生整型提升：00000000000000000000000011111111=255（无符号高位补0）
//	//正数原码补码相同
//	printf("a=%d,b=%d,c=%d", a, b, c);
//
//	return 0;
//}