#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
#include <string.h>
#include <math.h>
#include<stdlib.h>

int main() {
	
	int n = 9;
	//00000000000000000000000000001001
	float* pFloat = (float*)&n;
	printf("n的值为：%d\n", n);//9
	printf("pFloat的值为：%f\n", *pFloat);//0.000000
	//00000000000000000000000000001001(内存认为是浮点数存储形式)
	//0（s）    00000000（E）     00000000000000000001001(M)
	//E为全0    +0.00000000000000000001001*2^(-126)
	//只打印小数点后6位
	*pFloat = 9.0;
	//1001.0
	//1.001*2^3   E=3
	//0(s)   10000010(E)      00100000000000000000000(M)
	printf("n的值为：%d\n", n);//1091567616
	//01000001000100000000000000000000(内存认为是整数数存储形式)
	//01000001000100000000000000000000=1,091,567,616(正数补码与原码相同)
	printf("pFloat的值为：%f\n", *pFloat);//9.000000
	

	return 0;

}