//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//#include <string.h>
//#include <math.h>
//#include<stdlib.h>
//int main() {
//	/*int a = 6, b = 5;
//	printf("%d", a / b);*/      //打印结果为1
//
//	//double a = 6.0;
//	//int b = 5;
//	//printf("%lf", a / b);      //打印结果为1.200000
//
//	//int a = 2;
//	////把a的二进制位向左移动一位(0010->0100)
//	//int b = a << 1;
//	//printf("%d",b);        //打印结果为4
//
//	//int a = 10;
//	////把a的二进制位向右移动一位(1010->0101)
//	//int b = a >> 1;         //并不改变a的值
//	//printf("%d", b);        //打印结果为4
//	
//	//int a = 3;
//	//int b = 5;
//	////& - 按(2进制)位与
//	//int c = a & b;
//	////0011 -a
//	////0101 -b
//	////0001 -c(对应位上同为1才为1，否则为0)
//	//printf("%d", c);        //打印结果为1
//	
// //   int a = 3;
//	//int b = 5;
//	////| -按(2进制)位或
//	//int c = a | b;
//	////0011 -a
// //   //0101 -b
// //   //0111 -c(对应位上同为0才为0，否则为1)
//	//printf("%d", c);        //打印结果为7
//
//
//	
//	//int a = 3;
//	//int b = 5;
//	//// ^ -按(2进制)位异或
//	//int c = a ^ b;
//	////0011 -a
//	////0101 -b
//	////0110 -c(对应位相同为0，相异为1)
//	//printf("%d", c);        //打印结果为6
//	
//
//	//不创建中间变量交换a和b的值
//	//int a = 3;
//	//int b = 5;
//	//printf("a=%d, b=%d\n",a,b);
//	//a = a ^ b;
//	//b = a ^ b;
//	//a = a ^ b;
//	//printf("a=%d, b=%d\n",a,b);
//
//	//int a = 20;
//	//int x = 0;
//	//int y = 20;
//	//a = x = y + 1;
//	//printf("%d %d",a,x);//打印结果为21  21
//
//	//int a = 10;
//	//a = 100;
//	//a += 100;//与a = a + 100等价
//	////其他复合赋值符同理
//	
//	//int flag = 5;//为真
//	//printf("%d\n", !flag);//打印结果为0(为假)
//	//flag = 0;//为假
//	//printf("%d\n", !flag);//打印结果为1(为真)
//
//	//int a = 10;
//	//int arr[10] = { 0 };
//	//printf("%d\n", sizeof(arr));//计算arr所占空间大小，单位是字节，打印结果为40，因为int类型大小是4个字节，数组有10个元素
//	//printf("%d\n", sizeof(int));//打印结果是4，可以直接对类型用sizeof
//
//	//short s = 5;
//	//int a = 10;
//	//printf("%d\n", sizeof(s = a + 2));//打印结果为2(short类型大小为2个字节)
//	//printf("%d\n", s);//打印结果为5
//
//	//int a = -1;
//	////10000000000000000000000000000001 -原码
//	////11111111111111111111111111111110 -反码
//	////11111111111111111111111111111111 -补码
//	//// ~ 按位取反
//	////00000000000000000000000000000000(补码按位取反)
//	//int b= ~a;
//	//printf("%d",b);//打印结果为0
//	
//	//int a = 10;
//	////int b = a++;//后置++，先使用，再++
//	//int b = ++a;
//	//printf("%d\n", a);//打印结果为11
//	//printf("%d\n", b);//打印结果为10
//
//
//	//int a = 10;
//	//int b = ++a;//前置++，先++，后使用
//	//printf("%d\n", a);//打印结果为11
//	//printf("%d\n", b);//打印结果为11
//    
//	//int a = 10;
//    //printf("%d\n", a--); //打印结果为10
//    //printf("%d\n", a);//打印结果为9
//    
//	//int a = 10;
//    //printf("%p\n", &a);//& - 取地址操作符
//    //int *pa = &a;//pa是用来存放地址的 - pa就是一个指针变量
//    //*pa = 20;// * 解引用操作符 - 间接访问操作符
//    //printf("%d",a);//打印结果为20，*pa就代表着a
//	
//	//int a = (int)3.14;//将3.14double类型变量强制转换为int类型
//	//printf("%d", a);//打印结果为3
//
//    //int a = 3;
//	//int b = 0;
//	//if (a && b) {//a和b同时为真时，才进入下面的语句
//	//	printf("hello");//不执行此语句
//	//}
//	//if (a || b) {//a和b有一个为真，就进入下面的语句
//	//	printf("world");//执行此语句
//	//}
//    //int i = 0 , a = 0, b = 2, c = 3, d = 4;
//	//i = a++ && ++b && d++;
//	//printf("%d\n%d\n%d\n%d\n", a, b, c, d);//打印结果为1 2 3 4
//
//	/*int i = 0, a = 1, b = 2, c = 3, d = 4;
//	i = a++ || ++b || d++;
//	printf("%d\n%d\n%d\n%d\n", a, b, c, d);*///打印结果为 2 2 3 4
//
//
//	//int a = 3;
//	//int b = 0;
//	////三目操作符
//	//b = (a > 5 ? 1 : -1);//表达式1 ？表达式2 ：表达式3
//	//printf("%d", b);//打印结果为-1
//
//
// //   int a = 3;
//	//int b = 5;
//	//int c = 0;
//	////逗号表达式要向右依次计算，但是整个表达式的结果是最后一个表达式的结果
//	//int d = (c = 5, a = c + 3, b = a - 4, c += b);
//	//printf("%d",d);//结果为9
//
//
//	//int arr[10];//创建数组
//	//arr[9] = 10;//实用下标引用操作符
//	////[ ]的两个操作数是arr和9
//
//
//
//	//int a = 10;
//	//int b = 20;
//	//int ret = Add(a, b);//调用函数
//
//	//结构体
//	//书：书名，书号，定价
//	//创建了一个自定义的类型
//	//struct Book
//	//{
//	//	//结构体的成员变量
//	//	char name[20];
//	//	char id[20];
//	//	int price;
//	//};
//
//
//	//int num = 10;
//	//struct Book b = { "C语言","20191112537",55 };
//	////结构体变量.成员名
//	////printf("%s\n", b.name);
//	////printf("%s\n", b.id);
//	////printf("%d", b.price);
//
//	////结构体指针->成员名
//	//struct Book* pb = &b;
//	//printf("%s\n", pb->name);
// //   printf("%s\n", pb->id);
// //   printf("%d", pb->price);
//
//	//char a, b, c;
//	////...
//    //   a = b + c;
//    
// //   char a = 3;
//	////00000011 - a(char只能存8个bite位)
//	//char b = 127;
//	////01111111 - b
//	//char c = a + b;
//	////a和b都是char类型，都没有达到一个int的大小
//	////这里会发生整型提升,高位补的都是符号位(无符号统一补0)
//
//	////a整型提升后：00000000000000000000000000000011
//	////b整型提升后：00000000000000000000000001111111
//	////           c=00000000000000000000000010000010 
//	////c发生截断，只存8个bite位，c = 10000010
//	////此时c是char类型的变量，需要打印整型变量，再次发生整型提升
//	////c - 11111111111111111111111110000010     (高位补符号位1)
//	////但负数在内存中形式是补码，所以还要再求c的原码
//	////c的原码 - 10000000000000000000000001111110 = -126
//	//printf("%d\n", c);//打印结果为-126
//    
// //   char c = 1;
//	//printf("%u\n", sizeof(c));//1
//	//printf("%u\n", sizeof(+c));//4
//	//printf("%u\n", sizeof(-c));//4
//	//printf("%u\n", sizeof(!c));//4
//	/*%u是输出无符号整型数
//	+c  -c  !c  参与了运算，发生了整型提升，所以变为int的大小*/
//    
//    
//
//
//
//
//
// 
//	return 0;
//}